---
kind: property
id: P:Autodesk.Revit.UI.RibbonItem.ItemType
source: html/a2684698-096c-d278-a29f-698bc487716c.htm
---
# Autodesk.Revit.UI.RibbonItem.ItemType Property

Gets the item type.

## Syntax (C#)
```csharp
public RibbonItemType ItemType { get; }
```